package com.nightwolf.crm_test.bean

class PostMesBean {
    /**
     * scode : 0
     * body : {"report":{"id":1289613169836457,"type":3815252,"date":1593446400000,"submitAt":1593476941699,"plan":"1）app在登录页面密码输入错误时没有及时提示错误，等到点击登录后倒计时结束后才提示，操作不是很方便，建议优化\r2）坐席上来电后建议可以自动跳转到电话咨询席位上，这样一眼就可以看到来电人的信息，或者来电接通后页面就显示来电人信息","content":"1）守护中心接警加测试（3h）\r2）电商咨询回复（0.5h）\r3）测试居家养老测试（6.5h）\r\r处警情况\r1）无生命活动报警    处警时长：3分钟     已联系上长者确认是手表没有佩戴放在家里，人不在家导致的报警\n\n2）长时间不动报警    处警时长：1分钟     已联系上亲属，由亲属去现场处理\r3）按扭sos报警         处警时长：7分钟     已联系上紧急联系人，由紧急联系人确认报警情况\r\r电商客户咨询\r1）需要连接智能机使用吗？\r回答客户：不需要的亲，我们设备独立组网，手表、按钮报警信息是通过运营商基站转发给子女App和来邦养老24小时守护中心。而且手表即买即用，无后续通信费用。\r\r2）这个手表的功能都有哪些？功能挺实用的，这价格有点小贵，这个有什么优惠活动吗？\r回答客户：我们可以做到：\r1.自动监测报警（洗手间不动报警；洗手间滞留报警；在床不动报警等）和手动按键报警；\r2.每天清晨，能收到长者昨晚的睡眠质量、夜尿次数的统计报告；\r3.每天夜晚能收到长者当天的报警记录、离家记录、大解记录、在床记录、心率数据、手表离手记录等统计报告；\r4.每隔一段时间，能收到长者所在位置和运动状态；\r5.能及时获知长者离家回家动态；\r6.可随时查找长者的实时位置；\r7.可随时查看长者的当天活动轨迹。\r亲现在购买只要2880，活动期间购买赠送6年VIP权限哦，另赠送1年守护中心客服费用\r\r主要问题\r1）安卓子女app升级设备时提示手机电量过低，接上充电器电量充至10%以上再操作，实际手机电量40%\r2）手表到二维码界面升级时提示设备断开连接，请重新连接升级，第二次升级正常，测试两个手表提示一样\r3）手表升级后电量显示12%报了一条低电量报警，过一会后再次报警显示电量32%\n4）坐席上凌晨2点多收到的报警到了凌晨4点多才看到，开启了报警提醒没有提示（汤秀英）","fileName":"","fileUrl":"","recipient":956975,"status":2,"createdAt":1593476564260,"updatedAt":1593494000826,"user":{"uid":856582364168428,"name":"何洋洋-守护中心客服","icon":"","type":0},"createdBy":{"uid":856582364168428,"name":"何洋洋-守护中心客服","icon":"","type":0},"approver":{"uid":956975,"name":"戴元兵-养老产品总监","icon":"","type":0},"copyUsers":[{"uid":956973,"name":"王庆","icon":"","type":0},{"uid":1182596423385474,"name":"汪希祥-养老产品经理","icon":"https://xsybucket.s3.cn-north-1.amazonaws.com.cn/271301/2020/04/30/s_b33d84f0-0264-4988-8d15-68eed514a937.jpg","type":0},{"uid":1066504,"name":"王继浩-养老项目","icon":"","type":0},{"uid":1069080,"name":"郭子玉-养老测试副经理","icon":"","type":0},{"uid":957016,"name":"许军","icon":"","type":0},{"uid":1065207,"name":"钟传猛-养老项目","icon":"","type":0},{"uid":957019,"name":"童兴进-养老项目","icon":"","type":0},{"uid":1194852084023655,"name":"李雪晴-守护中心客服","icon":"","type":0},{"uid":1213283083206995,"name":"李武-养老项目","icon":"","type":0},{"uid":957977,"name":"丁骏-养老项目","icon":"","type":0},{"uid":957014,"name":"李秋生","icon":"","type":0},{"uid":1216602970603912,"name":"张天禄-养老项目","icon":"","type":0},{"uid":1216594755420491,"name":"田礼-养老项目","icon":"","type":0},{"uid":956977,"name":"韩锐","icon":"","type":0},{"uid":1070869,"name":"叶珑琳-养老产品经理","icon":"","type":0},{"uid":1216596243988829,"name":"胡春峰-养老项目","icon":"","type":0},{"uid":962516,"name":"李广泰-养老项目","icon":"","type":0},{"uid":712953,"name":"潘总","icon":"","type":0},{"uid":1065708,"name":"黄林晴-养老项目","icon":"","type":0},{"uid":856585016901848,"name":"汤正华-养老项目","icon":"","type":0},{"uid":1213280295387561,"name":"强睿-养老项目","icon":"","type":0},{"uid":961888,"name":"刘天皓-养老项目","icon":"","type":0},{"uid":956980,"name":"谢磊-养老项目","icon":"","type":0},{"uid":1069965,"name":"王耀-养老项目","icon":"https://xsybucket.s3.cn-north-1.amazonaws.com.cn/271301/2019/08/16/s_cbbbff92-19aa-4939-aec2-4377a2f35e83.jpg","type":0},{"uid":957113,"name":"刘闵","icon":"","type":0},{"uid":957112,"name":"卜亮亮-医院测试经理","icon":"","type":0}]},"businessTypes":[{"id":3815252,"belongId":25,"typeName":"日报"},{"id":3815253,"belongId":26,"typeName":"周报"},{"id":3816266,"belongId":27,"typeName":"月报"}]}
     */
    var scode: String? = null
    var body: BodyBean? = null

    class BodyBean {
        /**
         * report : {"id":1289613169836457,"type":3815252,"date":1593446400000,"submitAt":1593476941699,"plan":"1）app在登录页面密码输入错误时没有及时提示错误，等到点击登录后倒计时结束后才提示，操作不是很方便，建议优化\r2）坐席上来电后建议可以自动跳转到电话咨询席位上，这样一眼就可以看到来电人的信息，或者来电接通后页面就显示来电人信息","content":"1）守护中心接警加测试（3h）\r2）电商咨询回复（0.5h）\r3）测试居家养老测试（6.5h）\r\r处警情况\r1）无生命活动报警    处警时长：3分钟     已联系上长者确认是手表没有佩戴放在家里，人不在家导致的报警\n\n2）长时间不动报警    处警时长：1分钟     已联系上亲属，由亲属去现场处理\r3）按扭sos报警         处警时长：7分钟     已联系上紧急联系人，由紧急联系人确认报警情况\r\r电商客户咨询\r1）需要连接智能机使用吗？\r回答客户：不需要的亲，我们设备独立组网，手表、按钮报警信息是通过运营商基站转发给子女App和来邦养老24小时守护中心。而且手表即买即用，无后续通信费用。\r\r2）这个手表的功能都有哪些？功能挺实用的，这价格有点小贵，这个有什么优惠活动吗？\r回答客户：我们可以做到：\r1.自动监测报警（洗手间不动报警；洗手间滞留报警；在床不动报警等）和手动按键报警；\r2.每天清晨，能收到长者昨晚的睡眠质量、夜尿次数的统计报告；\r3.每天夜晚能收到长者当天的报警记录、离家记录、大解记录、在床记录、心率数据、手表离手记录等统计报告；\r4.每隔一段时间，能收到长者所在位置和运动状态；\r5.能及时获知长者离家回家动态；\r6.可随时查找长者的实时位置；\r7.可随时查看长者的当天活动轨迹。\r亲现在购买只要2880，活动期间购买赠送6年VIP权限哦，另赠送1年守护中心客服费用\r\r主要问题\r1）安卓子女app升级设备时提示手机电量过低，接上充电器电量充至10%以上再操作，实际手机电量40%\r2）手表到二维码界面升级时提示设备断开连接，请重新连接升级，第二次升级正常，测试两个手表提示一样\r3）手表升级后电量显示12%报了一条低电量报警，过一会后再次报警显示电量32%\n4）坐席上凌晨2点多收到的报警到了凌晨4点多才看到，开启了报警提醒没有提示（汤秀英）","fileName":"","fileUrl":"","recipient":956975,"status":2,"createdAt":1593476564260,"updatedAt":1593494000826,"user":{"uid":856582364168428,"name":"何洋洋-守护中心客服","icon":"","type":0},"createdBy":{"uid":856582364168428,"name":"何洋洋-守护中心客服","icon":"","type":0},"approver":{"uid":956975,"name":"戴元兵-养老产品总监","icon":"","type":0},"copyUsers":[{"uid":956973,"name":"王庆","icon":"","type":0},{"uid":1182596423385474,"name":"汪希祥-养老产品经理","icon":"https://xsybucket.s3.cn-north-1.amazonaws.com.cn/271301/2020/04/30/s_b33d84f0-0264-4988-8d15-68eed514a937.jpg","type":0},{"uid":1066504,"name":"王继浩-养老项目","icon":"","type":0},{"uid":1069080,"name":"郭子玉-养老测试副经理","icon":"","type":0},{"uid":957016,"name":"许军","icon":"","type":0},{"uid":1065207,"name":"钟传猛-养老项目","icon":"","type":0},{"uid":957019,"name":"童兴进-养老项目","icon":"","type":0},{"uid":1194852084023655,"name":"李雪晴-守护中心客服","icon":"","type":0},{"uid":1213283083206995,"name":"李武-养老项目","icon":"","type":0},{"uid":957977,"name":"丁骏-养老项目","icon":"","type":0},{"uid":957014,"name":"李秋生","icon":"","type":0},{"uid":1216602970603912,"name":"张天禄-养老项目","icon":"","type":0},{"uid":1216594755420491,"name":"田礼-养老项目","icon":"","type":0},{"uid":956977,"name":"韩锐","icon":"","type":0},{"uid":1070869,"name":"叶珑琳-养老产品经理","icon":"","type":0},{"uid":1216596243988829,"name":"胡春峰-养老项目","icon":"","type":0},{"uid":962516,"name":"李广泰-养老项目","icon":"","type":0},{"uid":712953,"name":"潘总","icon":"","type":0},{"uid":1065708,"name":"黄林晴-养老项目","icon":"","type":0},{"uid":856585016901848,"name":"汤正华-养老项目","icon":"","type":0},{"uid":1213280295387561,"name":"强睿-养老项目","icon":"","type":0},{"uid":961888,"name":"刘天皓-养老项目","icon":"","type":0},{"uid":956980,"name":"谢磊-养老项目","icon":"","type":0},{"uid":1069965,"name":"王耀-养老项目","icon":"https://xsybucket.s3.cn-north-1.amazonaws.com.cn/271301/2019/08/16/s_cbbbff92-19aa-4939-aec2-4377a2f35e83.jpg","type":0},{"uid":957113,"name":"刘闵","icon":"","type":0},{"uid":957112,"name":"卜亮亮-医院测试经理","icon":"","type":0}]}
         * businessTypes : [{"id":3815252,"belongId":25,"typeName":"日报"},{"id":3815253,"belongId":26,"typeName":"周报"},{"id":3816266,"belongId":27,"typeName":"月报"}]
         */
        var report: ReportBean? = null
        var businessTypes: List<BusinessTypesBean>? = null

        class ReportBean {
            /**
             * id : 1289613169836457
             * type : 3815252
             * date : 1593446400000
             * submitAt : 1593476941699
             * plan : 1）app在登录页面密码输入错误时没有及时提示错误，等到点击登录后倒计时结束后才提示，操作不是很方便，建议优化2）坐席上来电后建议可以自动跳转到电话咨询席位上，这样一眼就可以看到来电人的信息，或者来电接通后页面就显示来电人信息
             * content : 1）守护中心接警加测试（3h）2）电商咨询回复（0.5h）3）测试居家养老测试（6.5h）处警情况1）无生命活动报警    处警时长：3分钟     已联系上长者确认是手表没有佩戴放在家里，人不在家导致的报警
             *
             * 2）长时间不动报警    处警时长：1分钟     已联系上亲属，由亲属去现场处理3）按扭sos报警         处警时长：7分钟     已联系上紧急联系人，由紧急联系人确认报警情况电商客户咨询1）需要连接智能机使用吗？回答客户：不需要的亲，我们设备独立组网，手表、按钮报警信息是通过运营商基站转发给子女App和来邦养老24小时守护中心。而且手表即买即用，无后续通信费用。2）这个手表的功能都有哪些？功能挺实用的，这价格有点小贵，这个有什么优惠活动吗？回答客户：我们可以做到：1.自动监测报警（洗手间不动报警；洗手间滞留报警；在床不动报警等）和手动按键报警；2.每天清晨，能收到长者昨晚的睡眠质量、夜尿次数的统计报告；3.每天夜晚能收到长者当天的报警记录、离家记录、大解记录、在床记录、心率数据、手表离手记录等统计报告；4.每隔一段时间，能收到长者所在位置和运动状态；5.能及时获知长者离家回家动态；6.可随时查找长者的实时位置；7.可随时查看长者的当天活动轨迹。亲现在购买只要2880，活动期间购买赠送6年VIP权限哦，另赠送1年守护中心客服费用主要问题1）安卓子女app升级设备时提示手机电量过低，接上充电器电量充至10%以上再操作，实际手机电量40%2）手表到二维码界面升级时提示设备断开连接，请重新连接升级，第二次升级正常，测试两个手表提示一样3）手表升级后电量显示12%报了一条低电量报警，过一会后再次报警显示电量32%
             * 4）坐席上凌晨2点多收到的报警到了凌晨4点多才看到，开启了报警提醒没有提示（汤秀英）
             * fileName :
             * fileUrl :
             * recipient : 956975
             * status : 2
             * createdAt : 1593476564260
             * updatedAt : 1593494000826
             * user : {"uid":856582364168428,"name":"何洋洋-守护中心客服","icon":"","type":0}
             * createdBy : {"uid":856582364168428,"name":"何洋洋-守护中心客服","icon":"","type":0}
             * approver : {"uid":956975,"name":"戴元兵-养老产品总监","icon":"","type":0}
             * copyUsers : [{"uid":956973,"name":"王庆","icon":"","type":0},{"uid":1182596423385474,"name":"汪希祥-养老产品经理","icon":"https://xsybucket.s3.cn-north-1.amazonaws.com.cn/271301/2020/04/30/s_b33d84f0-0264-4988-8d15-68eed514a937.jpg","type":0},{"uid":1066504,"name":"王继浩-养老项目","icon":"","type":0},{"uid":1069080,"name":"郭子玉-养老测试副经理","icon":"","type":0},{"uid":957016,"name":"许军","icon":"","type":0},{"uid":1065207,"name":"钟传猛-养老项目","icon":"","type":0},{"uid":957019,"name":"童兴进-养老项目","icon":"","type":0},{"uid":1194852084023655,"name":"李雪晴-守护中心客服","icon":"","type":0},{"uid":1213283083206995,"name":"李武-养老项目","icon":"","type":0},{"uid":957977,"name":"丁骏-养老项目","icon":"","type":0},{"uid":957014,"name":"李秋生","icon":"","type":0},{"uid":1216602970603912,"name":"张天禄-养老项目","icon":"","type":0},{"uid":1216594755420491,"name":"田礼-养老项目","icon":"","type":0},{"uid":956977,"name":"韩锐","icon":"","type":0},{"uid":1070869,"name":"叶珑琳-养老产品经理","icon":"","type":0},{"uid":1216596243988829,"name":"胡春峰-养老项目","icon":"","type":0},{"uid":962516,"name":"李广泰-养老项目","icon":"","type":0},{"uid":712953,"name":"潘总","icon":"","type":0},{"uid":1065708,"name":"黄林晴-养老项目","icon":"","type":0},{"uid":856585016901848,"name":"汤正华-养老项目","icon":"","type":0},{"uid":1213280295387561,"name":"强睿-养老项目","icon":"","type":0},{"uid":961888,"name":"刘天皓-养老项目","icon":"","type":0},{"uid":956980,"name":"谢磊-养老项目","icon":"","type":0},{"uid":1069965,"name":"王耀-养老项目","icon":"https://xsybucket.s3.cn-north-1.amazonaws.com.cn/271301/2019/08/16/s_cbbbff92-19aa-4939-aec2-4377a2f35e83.jpg","type":0},{"uid":957113,"name":"刘闵","icon":"","type":0},{"uid":957112,"name":"卜亮亮-医院测试经理","icon":"","type":0}]
             */
            var id: Long = 0
            var type = 0
            var date: Long = 0
            var submitAt: Long = 0
            var plan: String? = null
            var content: String? = null
            var fileName: String? = null
            var fileUrl: String? = null
            var recipient: Double? = 0.0
            var status = 0
            var createdAt: Long = 0
            var updatedAt: Long = 0
            var user: UserBean? = null
            var createdBy: CreatedByBean? = null
            var approver: ApproverBean? = null
            var copyUsers: List<CopyUsersBean>? = null

            class UserBean {
                /**
                 * uid : 856582364168428
                 * name : 何洋洋-守护中心客服
                 * icon :
                 * type : 0
                 */
                var uid: String? = "0"
                var name: String? = null
                var icon: String? = null
                var type = 0

            }

            class CreatedByBean {
                /**
                 * uid : 856582364168428
                 * name : 何洋洋-守护中心客服
                 * icon :
                 * type : 0
                 */
                var uid: Long = 0
                var name: String? = null
                var icon: String? = null
                var type = 0

            }

            class ApproverBean {
                /**
                 * uid : 956975
                 * name : 戴元兵-养老产品总监
                 * icon :
                 * type : 0
                 */
                var uid: String? = "0"
                var name: String? = null
                var icon: String? = null
                var type = 0

            }

            class CopyUsersBean {
                /**
                 * uid : 956973
                 * name : 王庆
                 * icon :
                 * type : 0
                 */
                var uid: Long = 0
                var name: String? = null
                var icon: String? = null
                var type = 0

            }
        }

        class BusinessTypesBean {
            /**
             * id : 3815252
             * belongId : 25
             * typeName : 日报
             */
            var id = 0
            var belongId = 0
            var typeName: String? = null

        }
    }
}